[
  {
    "id": 1,
    "category": ["website", "dashboard"],
    "title": " I'm Here",
    "description": "A website that offers many services to suit all individuals using native HTML, Css and Javascript and control panel for managing a mobile application dedicated to a guide to stores in the city and displaying their details and offers as a SPA using Vue.js",
    "imagePath": "./images/projects/1.jpg"
  },
  {
    "id": 2,
    "category": ["dashboard"],
    "title": "GetUp",
    "description": "A control panel for managing two mobile applications specialized in providing lessons to high school students and managing points of sale dedicated to selling lesson packages codes as a SPA using Vue.js.",
    "imagePath": "./images/projects/2.png"
  },
  {
    "id": 3,
    "category": ["website", "dashboard"],
    "title": "GoHexana",
    "description": "A platform where you can take an account generate unique code to your products for example and a lot of kinds of data platform containe admin panel, landing page and e-commerce app, this project build with Vue.js framework and Three.js Library as a SPA.",
    "imagePath": "./images/projects/3.jpeg"
  },
  {
    "id": 4,
    "category": ["librarie", "website"],
    "title": "A-V Datatable",
    "description": "A vue component built to make work with tables easer and faster, The main Idea of the component is to create collabsible, selection table, ability to interact with data and transform it as the programer want, the component uploaded to the NPM and github with fully documentation for the way of using it.",
    "imagePath": "./images/projects/4.jpeg"
  },
  {
    "id": 5,
    "category": ["website"],
    "title": "CNC",
    "description": "A website to display designs that were printed using a CNC machine.",
    "imagePath": "./images/projects/5.jpeg"
  },
  {
    "id": 6,
    "category": ["dashboard"],
    "title": "FoxLearn Platform",
    "description": "An alternative platform for university education to study the state of automata and grammar models with their interactive tests.",
    "imagePath": "./images/projects/6.jpeg"
  },
  {
    "id": 7,
    "category": ["website", "dashboard"],
    "title": "ElType App",
    "description": "A web app where you can test your typing speed with another competitors depending on official competition app which built with Vue.js framework as a SPA, the app contain an admin panel with landing page where you can login with your unique code that you get from the organized company and you can test yourself and joining to the competitions.",
    "imagePath": "./images/projects/7.jpeg"
  },
  {
    "id": 8,
    "category": ["website", "dashboard"],
    "title": "Awija",
    "description": "A platform where you can take an account generate unique code to your products for example and a lot of kinds of data platform contain admin panel, landing page and e-commerce app, this project build with Vue.js framework and Three.js Library as a SPA.",
    "imagePath": "./images/projects/8.png"
  },
  {
    "id": 9,
    "category": ["website", "dashboard"],
    "title": "elCaptain",
    "description": "A dashboard to manage two mobile applications, the first for customers and the second for drivers, where drivers are located and tracked on a Google map and their status is known. Customers can order a taxi, the nearest taxi is suggested, and customers and drivers can be evaluated.",
    "imagePath": "./images/projects/9.png"
  },
  {
    "id": 10,
    "category": ["website", "dashboard"],
    "title": "Tarafoua",
    "description": "A control panel to manage two mobile applications specialized in serving university students, providing questions, exams courses, and points of sale that sell codes to students as a Vue.js.",
    "imagePath": "./images/projects/10.png"
  }
]
